#### Terraform Plan 📖

<details><summary>Show Plan</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.main has been deleted
  - resource "azurerm_resource_group" "main" {
        id       = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-windows-vm"
      - location = "eastus" -> null
      - name     = "rg-windows-vm" -> null
        tags     = {
            "Environment" = "Dev"
            "ManagedBy"   = "Terraform"
            "Service"     = "terraform-managed"
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-windows-vm"
      + tags     = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "terraform-managed"
        }
    }

  # random_string.storage_suffix will be destroyed
  # (because random_string.storage_suffix is not in configuration)
  - resource "random_string" "storage_suffix" {
      - id          = "0pncr02i" -> null
      - length      = 8 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "0pncr02i" -> null
      - special     = false -> null
      - upper       = false -> null
    }

  # module.azure_sql_database.azurerm_mssql_database.main will be created
  + resource "azurerm_mssql_database" "main" {
      + auto_pause_delay_in_minutes                                = (known after apply)
      + collation                                                  = (known after apply)
      + create_mode                                                = "Default"
      + creation_source_database_id                                = (known after apply)
      + enclave_type                                               = (known after apply)
      + geo_backup_enabled                                         = true
      + id                                                         = (known after apply)
      + ledger_enabled                                             = (known after apply)
      + license_type                                               = (known after apply)
      + maintenance_configuration_name                             = (known after apply)
      + max_size_gb                                                = 5
      + min_capacity                                               = (known after apply)
      + name                                                       = (known after apply)
      + read_replica_count                                         = (known after apply)
      + read_scale                                                 = (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + secondary_type                                             = (known after apply)
      + server_id                                                  = (known after apply)
      + sku_name                                                   = "S0"
      + storage_account_type                                       = "Geo"
      + tags                                                       = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "terraform-managed"
        }
      + transparent_data_encryption_enabled                        = true
      + transparent_data_encryption_key_automatic_rotation_enabled = false
      + zone_redundant                                             = (known after apply)
    }

  # module.azure_sql_database.azurerm_mssql_firewall_rule.allow_azure_services will be created
  + resource "azurerm_mssql_firewall_rule" "allow_azure_services" {
      + end_ip_address   = "0.0.0.0"
      + id               = (known after apply)
      + name             = "allow-azure-services"
      + server_id        = (known after apply)
      + start_ip_address = "0.0.0.0"
    }

  # module.azure_sql_database.azurerm_mssql_firewall_rule.whitelist_ip will be created
  + resource "azurerm_mssql_firewall_rule" "whitelist_ip" {
      + end_ip_address   = "89.27.102.166"
      + id               = (known after apply)
      + name             = "whitelist-ip"
      + server_id        = (known after apply)
      + start_ip_address = "89.27.102.166"
    }

  # module.azure_sql_database.azurerm_mssql_server.main will be created
  + resource "azurerm_mssql_server" "main" {
      + administrator_login                      = "sqladmin"
      + administrator_login_password             = (sensitive value)
      + connection_policy                        = "Default"
      + express_vulnerability_assessment_enabled = false
      + fully_qualified_domain_name              = (known after apply)
      + id                                       = (known after apply)
      + location                                 = "eastus"
      + minimum_tls_version                      = "1.2"
      + name                                     = (known after apply)
      + outbound_network_restriction_enabled     = false
      + primary_user_assigned_identity_id        = (known after apply)
      + public_network_access_enabled            = true
      + resource_group_name                      = "rg-windows-vm"
      + restorable_dropped_database_ids          = (known after apply)
      + tags                                     = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "terraform-managed"
        }
      + version                                  = "12.0"
    }

  # module.azure_sql_database.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.azure_sql_database.random_string.database_suffix will be created
  + resource "random_string" "database_suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.azure_sql_database.random_string.server_suffix will be created
  + resource "random_string" "server_suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.vm.random_password.admin will be destroyed
  # (because random_password.admin is not in configuration)
  - resource "random_password" "admin" {
      - bcrypt_hash      = (sensitive value) -> null
      - id               = "none" -> null
      - length           = 16 -> null
      - lower            = true -> null
      - min_lower        = 0 -> null
      - min_numeric      = 0 -> null
      - min_special      = 0 -> null
      - min_upper        = 0 -> null
      - number           = true -> null
      - numeric          = true -> null
      - override_special = "_%@" -> null
      - result           = (sensitive value) -> null
      - special          = true -> null
      - upper            = true -> null
    }

Plan: 8 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  - public_ip_address                     = "74.235.48.5" -> null
  + resource_group_location               = "eastus"
  - storage_account_primary_blob_endpoint = "https://bootdiag0pncr02i.blob.core.windows.net/" -> null
  - vm_id                                 = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-windows-vm/providers/Microsoft.Compute/virtualMachines/vm-rg-windows-vm" -> null
  - vm_name                               = "vm-rg-windows-vm" -> null

```

</details>

*Plan generated at: 2026-02-17T01:01:50.304Z*